<html>
<head>
  <title>Exam | Solve Sheet Download | PDF</title>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <style>
  body {
    font-family: 'kalpurush', sans-serif;
  }

  table {
      border-collapse: collapse;
      width: 100%;
  }
  table, td, th {
      border: 1px solid black;
  }
  th, td{
    padding: 4px;
    font-family: 'kalpurush', sans-serif;
    font-size: 13px;
  }
  @page {
    header: page-header;
    footer: page-footer;
    background-image: url({{ public_path('images/logo-background.png') }});
    background-size: cover;              
    background-repeat: no-repeat;
    background-position: center center;
    margin: 90px 60px 90px 60px;
  }
  .page-header,
  .page-header-space {
    height: 250px;
  }
  .graybackground {
    background: rgba(192,192,192, 0.7);
  }
  </style>
</head>
<body>
  <htmlpageheader name="page-header">
    <img src="{{ public_path('images/logo.png') }}" style="height: 50px; width: auto;">
    <div style="border-top: 1px solid green;"></div>
  </htmlpageheader>
  {{-- <h2 align="center">
    Test    
  </h2> --}}
  <p align="center" style="padding-top: 0px;">
    <span style="font-size: 20px;">পরীক্ষা - {{ $exam['name'] }}</span><br/>
  </p>
  <div style="padding-top: 0px; text-align: center;">
    <h1><b>{{ $exam['name'] }}</b></h1>
    <p>পূর্ণমান - {{ bangla($exam['examquestions']->count() * $exam['qsweight']) }}, কাটমার্ক - {{ bangla($exam['cutmark']) }}, সময় - {{ bangla($exam['duration']) }} মিনিট
    </p> 
  </div>
  
  <div class="" >  
    সত্যক সারণি
যে সকল টেবিল বা সারণির মাধ্যমে বিভিন্ন গেইটের ফলাফল প্রকাশ করা হয় অর্থাৎ লজিক সার্কিটের ইনপুটের উপর আউটপুটের ফলাফল প্রকাশ করা হয় তাই সত্যক সারণি।
প্রতিটি সত্যক সারণিতে ইনপুট দেয়ার জন্য একটি কলাম (উদাহরণস্বরূপ A এবং B), এবং আউটপুট দেখানোর জন্য একটি কলাম (উদাহরণস্বরূপ A XOR B) থাকে। আউটপুট কলামে সকল সম্ভাব্য ফলাফল দেখানো হয়। সত্যক সারণির প্রতিটি সারিতে সম্ভাব্য সকল মান (উদাহরণস্বরূপ, A = সত্য B = মিথ্যা) এবং এদের ফলাফল দেয়া থাকে। লুডভিগ ভিটগেনস্টাইনকে তার ট্র্যাকট্যাটাস লজিকো-ফিলোসফিকাস বইয়ের জন্য সত্যক সরণির উদ্ভাবকের কৃতিত্ব দেয়া হয়। কিন্তু এমিল লেওন পোস্ট আরও এক বছর আগেই প্রপরশনাল যুক্তির উপর একটি লিখা প্রকাশ করেছিলেন।
<br/> সত্যক সারণি
যে সকল টেবিল বা সারণির মাধ্যমে বিভিন্ন গেইটের ফলাফল প্রকাশ করা হয় অর্থাৎ লজিক সার্কিটের ইনপুটের উপর আউটপুটের ফলাফল প্রকাশ করা হয় তাই সত্যক সারণি।
প্রতিটি সত্যক সারণিতে ইনপুট দেয়ার জন্য একটি কলাম (উদাহরণস্বরূপ A এবং B), এবং আউটপুট দেখানোর জন্য একটি কলাম (উদাহরণস্বরূপ A XOR B) থাকে। আউটপুট কলামে সকল সম্ভাব্য ফলাফল দেখানো হয়। সত্যক সারণির প্রতিটি সারিতে সম্ভাব্য সকল মান (উদাহরণস্বরূপ, A = সত্য B = মিথ্যা) এবং এদের ফলাফল দেয়া থাকে। লুডভিগ ভিটগেনস্টাইনকে তার ট্র্যাকট্যাটাস লজিকো-ফিলোসফিকাস বইয়ের জন্য সত্যক সরণির উদ্ভাবকের কৃতিত্ব দেয়া হয়। কিন্তু এমিল লেওন পোস্ট আরও এক বছর আগেই প্রপরশনাল যুক্তির উপর একটি লিখা প্রকাশ করেছিলেন।
<br/> সত্যক সারণি
যে সকল টেবিল বা সারণির মাধ্যমে বিভিন্ন গেইটের ফলাফল প্রকাশ করা হয় অর্থাৎ লজিক সার্কিটের ইনপুটের উপর আউটপুটের ফলাফল প্রকাশ করা হয় তাই সত্যক সারণি।
প্রতিটি সত্যক সারণিতে ইনপুট দেয়ার জন্য একটি কলাম (উদাহরণস্বরূপ A এবং B), এবং আউটপুট দেখানোর জন্য একটি কলাম (উদাহরণস্বরূপ A XOR B) থাকে। আউটপুট কলামে সকল সম্ভাব্য ফলাফল দেখানো হয়। সত্যক সারণির প্রতিটি সারিতে সম্ভাব্য সকল মান (উদাহরণস্বরূপ, A = সত্য B = মিথ্যা) এবং এদের ফলাফল দেয়া থাকে। লুডভিগ ভিটগেনস্টাইনকে তার ট্র্যাকট্যাটাস লজিকো-ফিলোসফিকাস বইয়ের জন্য সত্যক সরণির উদ্ভাবকের কৃতিত্ব দেয়া হয়। কিন্তু এমিল লেওন পোস্ট আরও এক বছর আগেই প্রপরশনাল যুক্তির উপর একটি লিখা প্রকাশ করেছিলেন।
<br/> সত্যক সারণি
যে সকল টেবিল বা সারণির মাধ্যমে বিভিন্ন গেইটের ফলাফল প্রকাশ করা হয় অর্থাৎ লজিক সার্কিটের ইনপুটের উপর আউটপুটের ফলাফল প্রকাশ করা হয় তাই সত্যক সারণি।
প্রতিটি সত্যক সারণিতে ইনপুট দেয়ার জন্য একটি কলাম (উদাহরণস্বরূপ A এবং B), এবং আউটপুট দেখানোর জন্য একটি কলাম (উদাহরণস্বরূপ A XOR B) থাকে। আউটপুট কলামে সকল সম্ভাব্য ফলাফল দেখানো হয়। সত্যক সারণির প্রতিটি সারিতে সম্ভাব্য সকল মান (উদাহরণস্বরূপ, A = সত্য B = মিথ্যা) এবং এদের ফলাফল দেয়া থাকে। লুডভিগ ভিটগেনস্টাইনকে তার ট্র্যাকট্যাটাস লজিকো-ফিলোসফিকাস বইয়ের জন্য সত্যক সরণির উদ্ভাবকের কৃতিত্ব দেয়া হয়। কিন্তু এমিল লেওন পোস্ট আরও এক বছর আগেই প্রপরশনাল যুক্তির উপর একটি লিখা প্রকাশ করেছিলেন।
<br/>সত্যক সারণি
যে সকল টেবিল বা সারণির মাধ্যমে বিভিন্ন গেইটের ফলাফল প্রকাশ করা হয় অর্থাৎ লজিক সার্কিটের ইনপুটের উপর আউটপুটের ফলাফল প্রকাশ করা হয় তাই সত্যক সারণি।
প্রতিটি সত্যক সারণিতে ইনপুট দেয়ার জন্য একটি কলাম (উদাহরণস্বরূপ A এবং B), এবং আউটপুট দেখানোর জন্য একটি কলাম (উদাহরণস্বরূপ A XOR B) থাকে। আউটপুট কলামে সকল সম্ভাব্য ফলাফল দেখানো হয়। সত্যক সারণির প্রতিটি সারিতে সম্ভাব্য সকল মান (উদাহরণস্বরূপ, A = সত্য B = মিথ্যা) এবং এদের ফলাফল দেয়া থাকে। লুডভিগ ভিটগেনস্টাইনকে তার ট্র্যাকট্যাটাস লজিকো-ফিলোসফিকাস বইয়ের জন্য সত্যক সরণির উদ্ভাবকের কৃতিত্ব দেয়া হয়। কিন্তু এমিল লেওন পোস্ট আরও এক বছর আগেই প্রপরশনাল যুক্তির উপর একটি লিখা প্রকাশ করেছিলেন।
সত্যক সারণি
যে সকল টেবিল বা সারণির মাধ্যমে বিভিন্ন গেইটের ফলাফল প্রকাশ করা হয় অর্থাৎ লজিক সার্কিটের ইনপুটের উপর আউটপুটের ফলাফল প্রকাশ করা হয় তাই সত্যক সারণি।
প্রতিটি সত্যক সারণিতে ইনপুট দেয়ার জন্য একটি কলাম (উদাহরণস্বরূপ A এবং B), এবং আউটপুট দেখানোর জন্য একটি কলাম (উদাহরণস্বরূপ A XOR B) থাকে। আউটপুট কলামে সকল সম্ভাব্য ফলাফল দেখানো হয়। সত্যক সারণির প্রতিটি সারিতে সম্ভাব্য সকল মান (উদাহরণস্বরূপ, A = সত্য B = মিথ্যা) এবং এদের ফলাফল দেয়া থাকে। লুডভিগ ভিটগেনস্টাইনকে তার ট্র্যাকট্যাটাস লজিকো-ফিলোসফিকাস বইয়ের জন্য সত্যক সরণির উদ্ভাবকের কৃতিত্ব দেয়া হয়। কিন্তু এমিল লেওন পোস্ট আরও এক বছর আগেই প্রপরশনাল যুক্তির উপর একটি লিখা প্রকাশ করেছিলেন।
সত্যক সারণি
যে সকল টেবিল বা সারণির মাধ্যমে বিভিন্ন গেইটের ফলাফল প্রকাশ করা হয় অর্থাৎ লজিক সার্কিটের ইনপুটের উপর আউটপুটের ফলাফল প্রকাশ করা হয় তাই সত্যক সারণি।
প্রতিটি সত্যক সারণিতে ইনপুট দেয়ার জন্য একটি কলাম (উদাহরণস্বরূপ A এবং B), এবং আউটপুট দেখানোর জন্য একটি কলাম (উদাহরণস্বরূপ A XOR B) থাকে। আউটপুট কলামে সকল সম্ভাব্য ফলাফল দেখানো হয়। সত্যক সারণির প্রতিটি সারিতে সম্ভাব্য সকল মান (উদাহরণস্বরূপ, A = সত্য B = মিথ্যা) এবং এদের ফলাফল দেয়া থাকে। লুডভিগ ভিটগেনস্টাইনকে তার ট্র্যাকট্যাটাস লজিকো-ফিলোসফিকাস বইয়ের জন্য সত্যক সরণির উদ্ভাবকের কৃতিত্ব দেয়া হয়। কিন্তু এমিল লেওন পোস্ট আরও এক বছর আগেই প্রপরশনাল যুক্তির উপর একটি লিখা প্রকাশ করেছিলেন।
সত্যক সারণি
যে সকল টেবিল বা সারণির মাধ্যমে বিভিন্ন গেইটের ফলাফল প্রকাশ করা হয় অর্থাৎ লজিক সার্কিটের ইনপুটের উপর আউটপুটের ফলাফল প্রকাশ করা হয় তাই সত্যক সারণি।
প্রতিটি সত্যক সারণিতে ইনপুট দেয়ার জন্য একটি কলাম (উদাহরণস্বরূপ A এবং B), এবং আউটপুট দেখানোর জন্য একটি কলাম (উদাহরণস্বরূপ A XOR B) থাকে। আউটপুট কলামে সকল সম্ভাব্য ফলাফল দেখানো হয়। সত্যক সারণির প্রতিটি সারিতে সম্ভাব্য সকল মান (উদাহরণস্বরূপ, A = সত্য B = মিথ্যা) এবং এদের ফলাফল দেয়া থাকে। লুডভিগ ভিটগেনস্টাইনকে তার ট্র্যাকট্যাটাস লজিকো-ফিলোসফিকাস বইয়ের জন্য সত্যক সরণির উদ্ভাবকের কৃতিত্ব দেয়া হয়। কিন্তু এমিল লেওন পোস্ট আরও এক বছর আগেই প্রপরশনাল যুক্তির উপর একটি লিখা প্রকাশ করেছিলেন।

    {{-- <table class="">
      <tr>
        <th class="graybackground" width="35%">দপ্তরের নাম</th>
        <th class="graybackground">সদস্য সংখ্যা</th>
        <th class="graybackground">মোট সদস্যপদ বাবদ পরিশোধ</th>
        <th class="graybackground">মোট মাসিক কিস্তি পরিশোধ<br/>({{ bangla(date('F, Y')) }} পর্যন্ত)</th>
        <th class="graybackground">মোট মাসিক কিস্তি বকেয়া<br/>({{ bangla(date('F, Y')) }} পর্যন্ত)</th>
      </tr>

      @php
        $intotalmembers = 0;
        $intotalmontlypaid = 0;
        $intotalmontlydues = 0;
      @endphp
      @foreach($branch_array as $branch)
        <tr>
          <td>{{ $branch['name'] }}</td>
          <td align="center">{{ bangla($branch['totalmembers']) }} জন</td>
          <td align="center">৳ {{ bangla($branch['totalmembers'] * 2000) }}</td>
          <td align="center">৳ {{ bangla($branch['totalmontlypaid']) }}</td>
          <td align="center">৳ {{ bangla($branch['totalmontlydues']) }}</td>
        </tr>
        @php
          $intotalmembers = $intotalmembers + $branch['totalmembers'];
          $intotalmontlypaid = $intotalmontlypaid + $branch['totalmontlypaid'];
          $intotalmontlydues = $intotalmontlydues + $branch['totalmontlydues'];
        @endphp
      @endforeach

      <tr>
        <th class="graybackground" align="right">মোট</th>
        <th class="graybackground">{{ bangla($intotalmembers) }} জন</th>
        <th class="graybackground">৳ {{ bangla($intotalmembers * 2000) }}</th>
        <th class="graybackground">৳ {{ bangla($totalapproved->totalamount) }}</th>
        <th class="graybackground">৳ {{ bangla($intotalmontlydues) }}</th>
      </tr>
    </table> --}}
    {{-- {{ bangla($intotalmontlypaid) }} --}}
  </div>
 
  <htmlpagefooter name="page-footer">
    <small>ডাউনলোডের সময়কালঃ <span style="font-family: Calibri;">{{ date('F d, Y, h:i A') }}</span></small><br/>
    <small style="font-family: Calibri; color: #4472C4;">Generated by: https://bcsexamaid.com | Download Android App: BCS Exam Aid – </small>
    <small style="color: #4472C4;">বিসিএস এক্সাম</small>
  </htmlpagefooter>
</body>
</html>